In [61]:
import pandas as pd
import numpy as np

In [62]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [50]:
1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

SyntaxError: invalid syntax (<ipython-input-50-d84a20112518>, line 1)

In [51]:
df['FlightNumber'][1] = 10055
df['FlightNumber'][3] = 10075

<ipython-input-51-d6cf6dacde38>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1] = 10055
<ipython-input-51-d6cf6dacde38>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3] = 10075

In [52]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [ ]:
2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [54]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [55]:
#df_temp= df['From_To'].str.split("_")

In [63]:
temp = df.From_To.str.split('_', expand = True)

In [64]:
temp.columns = ['From', 'To']

In [67]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()

In [68]:
df = df.drop('From_To', axis=1)
df = df.join(temp)

In [69]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [ ]:
$df[['first_name', 'last_name']] = df.apply(lambda row: row['name'].split(), axis=1)

In [13]:
df

   From_To  FlightNumber  RecentDelays              Airline  From  To
0      NaN       10045.0      [23, 47]               KLM(!)   NaN NaN
1      NaN       10055.0            []    <Air France> (12)   NaN NaN
2      NaN       10065.0  [24, 43, 87]  (British Airways. )   NaN NaN
3      NaN       10075.0          [13]       12. Air France   NaN NaN
4      NaN       10085.0      [67, 32]          "Swiss Air"   NaN NaN

In [57]:
df_temp

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_To, dtype: object

In [58]:
new['From']= df_temp.From.str.title()
new['To']=df_temp.To.str.title()

AttributeError: 'Series' object has no attribute 'From'

In [ ]:
41. Delete the From_To column from df and attach the temporary DataFrame from the previous
questions.

In [59]:
df.drop(columns =["From_To"], inplace = True)
df['From']=new['From']
df['To']=new['To']

NameError: name 'new' is not defined